//>>WATERFALL MODEL
// модель водопад - это поэтапная модель планирования
// cостоит из следующих этапов
- опеделение требований
- проектирование
- разработка
- тестирование
- внедрение

//>> ПЛАНИРОВАНИЕ ИНТЕРФЕЙСОВ
// шпределение того как компоненты будут взаимодействовать 
// и с помощью каких функций

//<< КОНТРАКТ
// определет какие методы и функции будут доступны перед использованием

//<< КОНТРАКТНОЕ ПРОГРАММИРОВАНИЕ 
// это методология программирования которая предполагает создание контрактов
// для определения интерфейсов и взаимодействия между компонентами системы

//>> ATDD - Acceptance Test-Driven Development
//>> TDD - Test-Driven Development
// подходы к разработке с акцентом на тестирование
// первый предлагает создание автотестов
// второй создание тестов перед написанием кода
// что позволяет разработчикам сосредоточиться на реализации требований 
// и обеспечить более надежный код

