//>> АБСТРАКЦИЯ
// выделение общего из группы объектов
// в го делается с помощью интерфейсов

//>> НАСЛЕДОВАНИЕ
// создание новых типов на основе старых
// в го делается с помощью встраивания структур или интерфейсов в другие структуры
// встраивание - это коглда без объявления поля

//>> ПОЛИМОРФИЗМ
// способность объектов с одинаковой спецификой проявлять разное поведение
// в го это делается с помощью создание преренных, коллекций, параметоров, полей с типом интерфейса

//>> КОМПОЗИЦИЯ
// создание сложного обьекта из более простых
// в го это делается с помощью композиции
// это когда полями являются другие стрктуры, но у поля есть имя

//>> ИНКОПСУЛЯЦИЯ
// когда данные и методы с работающие с ними объединяются в один объект
// при этом и данные и методы деятся на публичные и на приватные