МИКРОСЕРВИСЫ
- подход к разработке, деление приложениа на отдельные сервисы, взаимодействующие по АПИ

ТРЕБОВАНИЯ
- микросервисы должны быть независимы
- должны быть stateless
- нужно выделять по мере необходимости

ПЛЮСЫ
- проще разрабатывать
- быстрее выкатывать
- можно масштабировать сервисы отдельно и как хочется по нагрузки
- можно применять любой язык
- можно запускать на отдельных сервера
- улучшенное масштабирование команд

МИНУСЫ
- тяжелее управлять
- тяжелее тестировать и отлаживать
- тяжелее мониторить
- сетевая сложность
- проблемы согласованности
