ПАТТЕРНЫ ДЕКОМПОЗИЦИИ
- деление на сервисы по сущностям (заказы, платежи)
- DDD - деление на сервисы по группам операций

ПАТТЕРНЫ ПЕРЕХОДА НА МИКРОСЕРВИСЫ
- душитель - выделяем сервисы по одному, пока микросервис не сдохнет

ПАТТЕРНЫ УПРАВЛЕНИЯ ДАННЫМИ
- база данных на сервис
- shared db, анти паттерн но иногда используется
- api композиция - прием одного запроса, направление ко многим микросервисам и агрегация
- cqrs - разделения запросов чтения от комманд на запись, при этом они могут ходить как в одну так и в отдельные базы
- event sourcing - хранение событий вместо состояния, применяется в асинхронных системах
- saga - хореография - когда все берут команды с брокера делают, кидают в брокер результат и проверяют результат по цепочке, оркестрация - один узел по очереди раздает команды микросервисам
- 2pc - ACID для распределенных систем, с блокировкой всех участниьков по команде одного
- outbox - пишем событие в базу чтоб непотерять в рамках транзакции, воркер тянет его и кидает в брокер
- inbox(идемпотентност) - все обработанные команды кидаем в базы, и при каждом исполнении проверяем их

ПАТТЕРНЫ КОММУНИКАЦИИ
- api gateway,маршрутизирует, агригирует, может делать аутентификацию, TLS, логи и тп.
- beckend for frontend BFF, мобилке и сайты по разному беку

ПАТТЕРНЫ ОБНАРУЖЕНИЯ
- client side service discovery
- server side service discovery

ПАТТЕРНЫ ДЕПЛОЯ
- service instance per host
- blue green - развертывание новой версии, после тестов перевод всего трафика на нее
- a/b - развертывание двух версий с разным функционалом и аналитика кто лучше
- canary - выброс тестовой версии на небольшую долю трафика в прод и проверка

ПАТТЕРНЫ ОТКАЗАУСТОЙЧИВОСТИ
- cirquit breakoer
- bulkhead
- retry

ПАТТЕРНЫ МОНИТОРИНГА
- агрегация логов например в ЕЛК со всех сервисов в единное место
- распределенная трассировка, просто добавляем id каждому запросу и ищем в логах
- health check
