ЗАЧЕМ?
- увеличивает скорость
- уменьшает нагрузку на CPU, память, RAM, DB, FL, сеть, внешние сервисы

КАКИЕ ТИПЫ КЭША ЕСТЬ?
- RAM - Redis, Memcached
- Nginx - статические сайты
- браузер, headers, cookies, картинки, страници

АЛГОРИТМЫ КЭШИРОВАНИЯ
- last recently used LRU - дольше всего не запрашивались
- last friquently used LFU - реже всего запрашивались
- FIFO - первый пришел, первый ушел
- random

ПРОБЛЕМЫ
- сложно поддерживать актуальность
- инвалидация, обычно при изменении данных в БД, нужно писать самому
- неактуальный кэш
