ЧТО СОБИРАЕМ?
- производительност - CPU, MEMORY, DISKS, сетевая активност
- доступность - http codes, время запросов
- логи
- ресурсы - число запросов, эффективност кэша
- оповещения - ошибки, сбои, пороговые значения
- показатели бизнеса - кол-во клиентов, заказов итп
- работу внешних сервисов
- безопастность и утечки данных


ЗАЧЕМ?
- выявление сбоев
- оценка производительности
- прогноз нагрузок
- мониторинг безопасности
- планирование ресурсов

ИНСТРУМЕНТЫ
- prometheus - временные ряды, CPU, MEMORY, DISK, запросы,
    сам ходит и спрашивает на написанный end point
    поддерживает оповещения
- grafana - визуализирует метрики, графики, дашборды, оповещения
- alertmanager - группировка, фильтрация, настройка правил для оповещений из prometheus
    в разные источники
- zabbix - метрики, визуализация, алерты, оповещения, триггеры
    для железных серверов, может на низком уровне


КАК СМАСШТАБИРОВАТЬ ПРОМЕТЕУС
- разные метрики пишут в разные инстансы prometheus,
    можно настроить глобальный итстанс, и /federation на собирающих инстансах
    и собирать самые важные метрики в одну базу, с помощью глобального, так же по pull модели
- писать и читать из удаленного хранилища типа Thanos с помощью настройки remote read and remote write,
    чем меньше данных тем бистрее работа, а запись вообще делегируется во внещние инстансы моментально
    victoria metrics при этом сжимает в 10-20 раз лучше и потребляет меньше CPU
    на больших обьемах очень заметно
- оптимизировать запросы
- настроить кэш, некоторые компоненты promutheus и grafana могут использовать кэш
- мониторить и оптимизировать ресурсы инстанса
- использовать кубер
