CI - Continious Integration
- интеграция кода в репозиторий
- авто сборка и тестирование автотестами

CD - Continius Delivery
- авто развертывание
- тестирование в реальных условиях
- ручное тестирование и одобрение

CD - Continius Deployment
- развертывание в прод
- мониторинг

ИНСТРУМЕНТЫ
Jenkins - может все, требует сервер, старый интерфейс
Travis CI - за деньги, облако
CircleCI - облако, дорого при больших нагрузках
GitLab CI/CD - лучшая интеграция на рынке, легко масштабировать, можно свой сервер но если упал все встало
TeamCity - может все, сложнее настраивать
GitHub Actions - только облако
