GIT
- git init - создание репозитория локально
- git clone - клонирование из репозитория
- git add - добавить измененные файлы
- git commit - сделать комит
- git pull - подтянуть изменения из репозитория и слить с текущей веткой
- git fetch - подтяныть изменения из репозитория без слияния
- git push - отправить изменения
- git branch - управление ветками
- git merge - обьединение веток
- git checkout - переключение между ветками и коммитами

- git tag - работа с тегами
- git rebase - изменение истории коммитов
- git cherry-pick - применение коммитов из одной ветки в другую
- git bisect - поиск багованной версии
- git stash - временное сохранение изменений без коммита
- git reflog - позволяет восстанавливать и смотреть удаленные или утерянные коммиты
- git filter-banch - для массового изменения истории коммитов
- git module - включение одного репозиторий в другие
- git worktree - работа с несколькими рабочими деревьями внутри одного репозитория


РАЗРЕШЕНИЕ КОНФЛИКТОВ МЕРДЖА С ПОМОЩЬЮ git mergetool
- настройка инструмента, meld, kdiff3, vimdiff,
    git config --global merge.tool <название-инструмента>

    # Указываем путь к Zed как к mergetool
    git config --global mergetool.zed.cmd 'zed --wait $MERGED'

    # Делаем его инструментом по умолчанию
    git config --global merge.tool zed

    # Отключаем создание лишних .orig файлов (по желанию)
    git config --global mergetool.keepBackup false
- когда мерджим и есть конфликты
    git mergetool
- после разрешения конфликта в файле и закрытия инструмента Git перейдет к следующему файлу
- когда все разрешил
    git commit

ПОДХОДЫ
- Git Flow
    - main(master) - всегда стабильная ветка, нельзя коммитить сюда
    - develop - обьединение feature веток, нельзя коммитить сюда, обязательно tests
    - feature/name - branch от develop ветки для конкретной фичи по таске, может вернуться в develop только через pull request
    - release/version_number - branch от develop для фикса версии, тестится, коммитим в нее только фиксы,
      после тестов и фиксов льем в main с тегом и в develop
    - hotfix/feature_name - branch от main, исправление багов, и льем в main и в develop
    PROS
        - удобно для код ревью
        - когда релизы 1-2 недели
        - хорошо с паралельными рельзамк
    CONS
        - сложно часто релизить
        - много конфликтов
        - много merge коммитов

- TBD - trunk based development
    - main или trunk - основная ветка
    - feature/change_name - branch от main, попадает в main черес pull с прохождением тестов, живет 1-2 дня
        // вливание с feature flags с помошью environment variables, приложение должно иметь автоизменение конфигов
        if features.IsEnabled("new-checkout-system") {
            runNewCode()
        } else {
            runOldCode()
        }
    - release/version - branch от main

    PROCESS
    - льем часть фичи,
    - потом еще одну,
    - потом как канарейка проверяем
    - прокатывает, удаляем флаг и переход на новый функционал

    PROS
        - быстрые итерации изменений
        - небольшие код ревью
        - можно узать новый код в нескольких фичах
        - быстро включать и выключать фичи
    CONS
        - плохо для неопытных
        - нужны норм Devops ы
        - для маленьких команд
        - нужно большое покрытие тестам

ТЕГИ
- для отметки важных этапов

SEMVER - методология
    0.1.2-vers.3
0 - мажорная версия - несовместимые изменения
1 - минорная версия - новые возможности с обратной совместимостю
2 - патч-версия - обратно совместимые исправления ошибок
vers - предрелизные версии, alpha, beta, rc(release candidate) (1.0.0-alpha.1)
3 - методанные, может быть временная метка(1.0.0+20130313144700)
