ОПАСНОСТИ
- перехват трафика eavesdropping
    - используй TLS
- имитаций сервера server impersonation
    - используй аутентификацию сервера
- имитация клиента
     - авторизация, аутентификация, двуфакторная авторизация
- межсайтовый скриптинг cross site scripting XSS,
  когда в поле ввода(отзыв) вводят код JS который при просмотре запускается на браузере и пиздит куки и тп...
    - фильтруй, экранируй данные передаваемые на клиент с заголовками Content Security Policy, SameSite куки, HttpOnly
- межсайтовая подделка запроса cross site request forgery CSRF,
  засовывают ссылку в невидимую картинку <img src="http://mybank.com....">,
  когда браузер переходит по ней, он передает и куки,
  и если по ссылке можно что то поменять, это делается от имени пользователя
    - используй скрытые в формах токены CSRF и проверяй их на сервре, SameSite куки, ограничение прав
- утечка информации data leakage
    - ошибки не должны давать информацию
- SQL иньекции
    - используй параметризованные запросы, фильтры, экраны, белый список вместо черного, валидацию, хранимые процедуры
- отказ в обслуживании DOS DDOS
    - используй ограничение запросов, контроль скорости, балансировку нагрузки
- незащищенные сессии токены
    - используй HTTPS, HttpOnly и Secure куки
- недостаточное обновление
    - обновляй патчи безопасности, ПО, библиотеки и зависимости
