//>> СООТВЕТСТВИЕ ДАННЫХ
// bool 			- выражаются как JSON true или false.
// string 			- выражаются в виде строк JSON, по умолчанию небезопасные символы HTML экранируются.
// float32, float64 - выражаются в виде чисел JSON.
// int, int<size> 	- выражаются в виде чисел JSON.
// uint, uint<size> - выражаются в виде чисел JSON.
// byte 			- выражаются в виде чисел JSON.
// rune 			- выражаются в виде чисел JSON.
// nil 				- выражается как null значение JSON.
// Pointers 		- берет значение по указателю