//>> БАЗА

//>> ПРИНЦИП РАБОТЫ
// программа это список команд управляемых по порядку
// есть программный счетчик
// после выполнения команды, счетчик увеличивается на 1
// если нужно управлять ветвлениями или циклами 
// происходит управление командным счетчиком(изменение его значения)

// после выполнения всех команд происходит сброс счетчика
// эту же функцию выполняет кнопка или ножка reset

//>> СУТЬ РАБОТЫ ПРОГРАММЫ
//<< ПОНИМАНИЕ СТРОЕНИЯ ПАМЯТИ
// микроконтроллер состоит из:
//      - регистров общего назначения - данные с которыми оперируют программы
//      - регистров ввода вывода - память которая регулирует настройки и состояини доп устройств
//      - RAM - память для промежуточных вычислений
// все они стираются при выключения питания

//<< ВЕСЬ СМЫСЛ РАБОТЫ 
// записать в регистры ввода вывода правильные настройки
// промежуточные вычисления при необходимости 
// помещаются в регистры общего назначения
// а затем в порты ввода вывода или наоборот
// та к и работает программа
// так я и считываю состояния или записываю его

//>> EEPROM
// эта память не стирается при выключении
// для сохранения состояния программы