//>> РАБОЧИЙ ПОТОК

//<< СОЗДАНИЕ ВЕТКИ
// когда получил задачу
// создавай ветку

// ветку нужно создать а потом перейти на нее
// это сделать можно двумя способами
git branch branchName
git checkout branchName

// или 
git checkout -b branchName

//<< СЛИЯНИЕ
// если я работаю долго и не закончил
// и я пока не хочу пушить в репозиторий
// но мне нужны изменеия из мастера в моей ветке
// так как челы меняют основную ветку часто
// я иду в мастер
git checkout master 
// обновляю мастер из репозитория
git pull origin master
// иду в мою ветку
git checkout myBranch
// и мерджу основную ветку в мою и у меня актуальный код в ветке
git merge master

// когда сделал изменения и комит
// делаю слияние c основной веткой
// для этого перехожу в мастер
git checkout master 
// она всегда будет up to date так как локально ты ее не менял
// тут нужно ее обновить с репозитория, так как нужна актуальная версия
git pull origin master
// мержим свою ветку в мастер находясь на мастер ветке
git merge myBranch
// и пушим в репозиторий
git push origin master 

//<< РЕБЕЙС

//>> ПЕРЕМЕЩЕНИЕ ПО КОММИТАМ
// переход на комит выше
git checkout master^
// или
git checkout HEAD^

// переход на 2 комита выше
git checkout master^^
// или
git checkout HEAD^^

// переход на 3 и более комита выше
git checkout master~3
// или
git checkout HEAD~3

//>> ОТМЕНА КОММИТОВ
// стереть последний коммит и перейти на предидущий в локальном репозитории
git reset HEAD~1                                

// стереть последний коммит и 
git revert HEAD