//>> УКАЗАТЕЛИ
// указатель это переменная, значением которой является адрес в памяти 
// на конкретный тип, и это важно
// * - означает что это указатель
// & - означает положи в переменную адрес
num:=3
var pNum *int = &num

// если хотим достать значение
// * - означает - прочитай значение по адресу

//>> ПОЛЕЗНО
//! попытка получить значение по нулевому указателю выдаст ошибку
//! если указатель ссылается на элемент слайса, при сортировке слайса, указатель будет ссылаться на ту же ечейку, но там будет другой элемент

