//>> ОЖИДАНИЕ ГРУППЫ ГОРУТИН
// нужны когда делаешь несколько запросов на сторонние ресурсы паралельно 
// и ждешь их все, для отправки ответа

// обьявляем группу ожидания
var wg sync.WaitGroup 

// говоришь сколько будет горутин в группе
wg.Add(2)

// запускаешь какие-то две горутины
   go work(1) 
   go work(2)

// и ожидаешь, похоже на await
// здесь основной поток остановится пока не выполнятся все горутины
wg.Wait()

//>> ЗАВЕРШЕНИЕ ГОРУТИНЫ
// когда горутина закончена
// уменьшить количество ожидаемых горутин
// для этого используем метод Done()

func do(wg *sync.WaitGroup) {
	fmt.Println("do")
	wg.Done()
}

func main() {
	var wg sync.WaitGroup
	wg.Add(1)
	go do(&wg)
	wg.Wait()
	fmt.Println("Main Done")
}

//! ВАЖНО не копируй wg никогда, предавай ссылку 
// иначе можно заблокировать горутины по ошибке
// или поймать панике если сделать Done в двух 