//>> UMASK
// это маска прав которая по умолчанию в ОС
// все права указываемые при создании файлов и директорий
// уменьшаются с учетом ее значение
//<< значение маски
// в консоли(у меня 0022)
$ umask 

//<< установка значения маски
$ umask 0000

//<< как это работает
// все права в восьмиричной форме
// например создав папку с правами 0777
// получим папку с правами 0777 - параметры маски 
// это drwxr-xr-x вместо drwxrwxrwx

//<< как обойти маску
// создать папку или файл и поменять права с помощью Chmod

//<< расчет прав
// права регулируются 
// - тремя битами для пользователя
// - тремя битами для группы
// - тремя битами для остальных  

// 000 - это rwx соответственно
// маска это то что убираем
//      права   Ox      bx
//      -–x	    1	    001	    только выполнение 
//      -w-	    2	    010	    только запись
//      -wx	    3	    011	    завись и выполнение
//      r–-	    4	    100	    только чтение
//      r-x	    5	    101	    чтение и выполнение
//      rw-	    6	    110	    чтение и запись
//      rwx	    7	    111	    все разрешено


	