//>> НЮАНСЫ
// Client может отслеживать файлы cookie, 
// которые он получает от сервера, 
// и автоматически включать их в последующие запросы
// но эту фичу нужно включить в клиенте
// создав реализацию интерейса CookieJar в клиенте
// с помощью функции New пакета "net/http/cookiejar"
// если клиентов несколько
// то у каждого клиента будут свои куки

client := http.Client{}
jar, _ := cookiejar.New(nil)// nil - конфигурация, которая нах не нужна
client.Jar = jar
// теперь клиент будет запоминать значение кук с сервака и слать их обратно


