//>> НЮАНСЫ
// если клиент делает запрос
// и сервер делает редирект
// клиент будет следовать редиректу не более 10 раз
// это поведение можно изменить

//<< CheckRedirect
// это поле позволяет передать функцию
// которая принимает ссылку на Request, 
// и слайс ссылок предидущих Request
// в ней я могу реализовать нужное мне поведение
// например посчитать редиректы и, при привышении вернуть ошибку, 
// которая вернется как результат из метода делающего запросы
// например Do
// или перенаправить на другой URL
// например
client := http.Client{}
	client.CheckRedirect = func(req *http.Request, previous []*http.Request) error {
		if len(previous) == 3 {
			url, _ := url.Parse("http://localhost:5000/html")
			req.URL = url
		}
	return nil
}