//>> ВВОД В КОНСОЛЬ
int age;
printf("Input your age:");
scanf("%d", &age);

printf("age = %d", age);

//>> СОСТАВ ФОРМАТНОЙ СТРОКИ
// % ширина модификатор спецификатор
double price;
long code;
printf("Enter the product code: ");
scanf("%ld", &code);
printf("Enter the price: ");
scanf("%lf", &price);
printf("Product code: %ld \t price: %.2lf \n", code, price);

//<< модификаторы
// h : для ввода значений типа short int(% hd)
// l : для ввода значений типа long int(% ld) или double(% lf, % le)
// L : для ввода значений типа long double(% Lf, % Le)

//<< спецификаторы
// %c: считывает один символ
// %d: считывает десятичное целое число
// %i: считывает целое число в любой системе (десятичной, шестнадцатеричной, восьмеричной)
// %u: считывает положительное целое число
// %e: считывает число с плавающей точкой в экспоненциальной форме
// %E: считывает число с плавающей точкой в экспоненциальной форме с заглавным символом экспоненты
// %f: считывает число с плавающей точкой
// %F: считывает число с плавающей точкой
// %g: считывает число с плавающей точкой
// %G: считывает число с плавающей точкой
// %o: считывает восьмеричное число
// %x: считывает шестнадцатеричное число
// %X: считывает шестнадцатеричное число
// %s: считывает строку
// %%: считывает символ процента

scanf("%10s", name); // считатет только 10 символов
// тут если будет пробед до 10 символов то возьмется только первая часть

//>> ВВОД СОСТАВНЫХ ИМЕН
char name[10];
printf("Enter your name: ");
// здесь говорим чтать 10 символов или пока не введем \n, то есть Enter
scanf("%10[^\n]", name);

printf("Name: %s \n", name);
return 0;
