MEMORY USAGE RULES
1 - не бойся кучи, бойся переаллокаций
// кучи нельзя избежать, так как стек очень маленький

2 - создавай строки через конструктор
// данные будут лежать рядом
// в пределах одной страници
// это ускоряет манипуляции с памятью

3 - размещай поля по убыванию размера, с учетом размера кэш линии, поставь тег [repr(C)] чтобы компилятор не поменял порядок полей в структуре
// strings вначале 24 bytes голова
// vec вначале 24 bytes голова
// потом типы 8 bytes, Box, i64, f64, usize
// потом типы 4 bytes, u32, f32, char
// потом типы 2 bytes, u16
// потом типы 1 byte, u8, bool
// тут разместятся данные, при создании с помощью констуктора

// но помни что нужна уложить с учетом кеш линии(64 byte), например
// string - 24
// string - 24
// i64 - 8
// f64 - 8
// первая кэш линия
//
// string 24
// vec 24
// i64
// i32
// f32
// вторая кэш линия

4 - лимитируй все поля которые только возможно, планируй это при разработке приложения
// то что можешь лимитировать, лимитируй кратно 64 bytes
// не лемитированные поля клади в конце, так как при реалокации они улетят

5 - самые часто используемые поля выше редкоиспользуемых полей
// они с большей вероятностью попадут в кэш процессора



