//>> ПОИСК
// гугл ищет каждое слово по отдельности в запросе, и по частоте выдает результат
// и в приоритет берет из самую частую комбинацию

//<< ""
// ковычки заставляют искать конкретное вхождение именно фразы
// "с кем спит Вася"

//<< OR
// можно делать слово в запросе вариативным
// с кем спит Вася OR Петя

//<< -
// можно исключить слово в
// с кем -не спит Вася OR Петя

//<< *
// можно заменить забытую букву
// с кем -н* спит Вася OR Петя

//<< site
// site:kiss.ru - все страницы
// site:kiss.ru телочки- все упоминания слова на сайте

//<< intitle allintitle
// intitle:вася - ищет вася в заголовках страниц на сайте
// allintitle:вася спит - ищет все вхождение в заголовках страниц на сайте

//<< intext allintext
// intext:вася - ищет вася в теле страниц на сайте
// allintext:вася спит - ищет все вхождение в теле страниц на сайте

//<< inurl
// intext:kiss.ru - ищет в ссылках на сайте

//<< cash
// cash:kiss.ru - выведет последнюю закешированную версию сайта в поисковике

//<< link
// link:kiss.ru - где упоминается сайт

//<< info
// info:kiss.ru - позволяет достать контакты с сайта

//<< сайты на которых разрешен простмотр содержимого папок
// intitle:"index of /" Parent Directory

//<< filetype
// поиск файлов с именем и типом, можно выбирать любые расширения
// "shit" filetype:pdf
// filetype:doc intext:password - так можно половить файлы с паролями

