//>> МЫШЛЕНИЕ
// В процессе познания мы ОЩУЩАЕМ материальные свойства предмета(твердость, цвет...) или явления
// Совакупность свойств мы обьединяем в предмет, и создаем ОБРАЗ предмета.
// Идентификация этого образа могзом называется ВОСПРИЯТИЕ.

// Процесс сопоставление, сравнение и пререработка ощущений и образов, 
// выделения важного и существенного, определения связей и отношений вещей и явлений
// называется МЫШЛЕНИЕМ.

// Похожие предметы и явления мы ОБОБЩАЕМ,я.
// присваивает свойства предмета или явления всем подобным предметам.

// Это дает нам возможность ОПОСРЕДОВАННО понимать действительность
// например, везде где есть дым, можно судить о наличии огня, не видя его

// МЫШЛЕНИЕ - есть ОПОСРЕДОВАННОЕ и ОБОБЩЕННОЕ понимание действительности.
// По этому мы можем осозновать то что не видим напрямую.

//>> ЛОГИЧЕСКИЕ ПРИЕМЫ
// в процессе мышления, для формирования понятий, мы используем следующие приемы:
//<< СРАВНЕНИЕ - для понимания сходств и различий предметов и явлений.
// Чтобы правильно сравнивать:
// - Во первых, обьекты сравнения должны быть связаны. Бесполезно сравнивать ум и яблоко.
// - Во вторых, нужно определить основу сравнения. Сравнивать мастера по обьему не правильно, 
//   важно добавлять и качество работ.
// - В теретих, сравнивать нужно по одному и тому же признаку, в одних и тех же обстоятельствах.
//   Сравнивая два сосуда с водой на огне, можно прити к выводу что при нагреве воды идет пар.
// - В четвертых, сравнение должно производиться только по важным и существенным признакам.
//   Сравнивать строй по географическому положению неправильно.

//<< АНАЛИЗ И СИНТЕЗ - для осмысления вещей наиболее полно
// АНАЛИЗ - разбиение сложного на отдельные части, и осознание их по отдельности
// СИНТЕЗ - обьединение понятых частей в единое целое для осознания целостной картины

//<< АБСТРАГИРОВАНИЕ И ОБОБЩЕНИЕ - обьединения предметов и явлений в группы по свойствам для их различения 
// АБСТРАГИРОВАНИЕ - выделение определенных важных свойств вещей и формирование абстракций(вода уталяет жажду, волчица кормит щенят молоком)
// ОБОБЩЕНИЕ - обьединение схожих предметов и явлений в мысленные образы(напитки, млекопитающие)