//>> ПОНЯТИЯ
// в процессе мышления образуются понятия

// вещи и явления в мышлении - ПРЕДМЕТЫ мысли

// свойства предметов мысли - являются ПРИЗНАКАМИ

// ПОНЯТИЕ — это мысль, которая отображает общие и существенные признаки предметов

// ПОНЯТИЕ является правильным если отражает действительность

// практика позволяет проверить правильность понятий

//<< понятия и представления
// ПРЕДСТАВЛЕНИЯ - наглядный образ предмета, 
// а ПОНЯТИЯ - сущность вещей

// представления всегда индивидуальны
// и не может быть представления о таких вещах как скорость света.

//<< понятие и слово
// языковой оболочкой понятия является СЛОВО

//<< содержание и обьем понятия
// СОДЕРЖАНИЕ ПОНЯТИЯ - знание о совокупности существенных признаков класса предметов
// ОБЬЕМ ПОНЯТИЯ - круг вещей и явлений который затрагивается понятием
// чем больше содержание понятия, тем меньше его обьем
// обьяе понятия животные всегда меньше обьема понятия млекопитающие, а содержани е наоборот

//<< ограничение и обобщение понятия
// ОГРАНИЧЕНИЕ - переход от более общего к менее общему понятию. Животное, например слон.
// ОБОБЩЕНИЕ - переход от иенее общего к более общему. Слон - животное.

// ограничением нужно пользоваться при разьяснении, вначале описывая более общие понятия
// и постепенно переходя к менее общим, доходя в итоге до обсуждаемого.
// например разьесняя свойства натрия, начать можно с того, 
// что это хим элемент, потом металл, потом натрий
// или когда нужно обьяснить к какому кругу понятий оно относится

// обобщением пользуемся для выделения общих признаков

//<< родовые и видовие понятия
// РОДОВЫЕ  - предки видовых, более общие понятия
// ВИДОВЫЕ - потомки родовых, менее общие понятия 
// понятия могут быть родовыми по отношению к одним понятиям
// и видовыми по отношению к другим, но никогда не могут быть сами по себе

//<< классы понятий
// ЕДИНИЧНЫЕ ПОНЯТИЯ - понятия об индивидуальных(эксклюзивных) предметах
// ОБЩИЕ ПОНЯТИЯ - отображают множество предметов(школа, книга)
// СОБИРАТЕЛЬНЫЕ - отображают совокупность предметов(библиотека, собрание)

// при этом могут быть ЕДИНИЧНЫЕ СОБИРАТЕЛЬНЫЕ ПОНЯТИЯ - библиотека имени Ленина
// и ОБЩЕЕ СОБИРАТЕЛЬНОЕ ПОНЯТИЕ - созвездие, полк, народ

//>> ОТНОШЕНИЯ МЕЖДУ ПОНЯТИЯМИ
// все понятия как то связанны между собой

//<< НЕСРАВНИМЫЕ
// например медведь и доска связаны только тем, что оба являются представлением реальности
// такие понятия, которые находятся в далеком отношении являются НЕСРАВНИМЫМИ

//<< СРАВНИМЫЕ
// понятия в близком отношении, делятся на:
// СОВМЕСТИМЫЕ - когда обьемы совпадают полностью или частично
// НЕСОВМЕСТИМЫЕ - когда обьемы понятий не совпадают

//>> ОТНОШЕНИЯ СОВМЕСТИМЫХ ПОНЯТИЙ

//<< ОТНОШЕНИЯ ТОЖДЕСТВА
// это разные понятия об одних и тех же вещах
// Москва и столица России
// социализм и первая фаза коммунизма

//<< ОТНОШЕНИЕ ПОДЧИНЕНИЯ
// когда менее общее входит в обьем более общего
// это отношение вида и рода
// береза и дерево
// береза - ПОДЧИНЕННОЕ понятие
// дерево - ПОДЧИНЯЮЩЕЕ понятие

//<< ОТНОЩЕНИЕ ЧАСТИЧНОГО СОВПАДЕНИЯ ОБЬЕМОВ
// такие понятия называются
// ПЕРЕКРЕЩИВАЮЩИЕСЯ ПОНЯТИЯ - понятия которые частично совпадают по обьемам
// комсомольцы и колхозники, рабочие и москвичи, художники и поэты

//>> ОТНОШЕНИЯ НЕСОВМЕСТИМЫХ ПОНЯТИЙ

//<< ОТНОШЕНИЕ СОПОДЧИНЕНИЙ
// когда несколько видовых подчинены одному родовому
// европпа, азия и африка соподчинены понятию части света

//<< ОТНОШЕНИЕ ПРОТИВОПОЛОЖНОСТИ
// два противоположных понятия
// черный цвет - белый цвет, храбрость - трусость

//<< ОТНОШЕНИЕ ПРОТИВОРЕЧИЯ
// когда одно отрицает другое, но оно не определено по содержанию
// белое - не белое